Revit 2027 API
InstanceBinding Constructor
Constructs an empty instance binding.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InstanceBinding()
Public Sub New
public:
InstanceBinding()
new : unit -> InstanceBinding
Remarks
Categories can be set a later time by using the Categories property of this object.
See Also
Reference
InstanceBinding Class
InstanceBinding Overload
Autodesk.Revit.DB Namespace